[
    {
    "id": "const_01",
    "title": "1987 Constitution: Preamble & Territory",
    "excerpt": "Preamble, National Territory, and Declaration of Principles.",
    "images": [
      "https://officialgazette.gov.ph/images/uploads/1987-Constitution.jpg"
    ],
    "sources": [
      "https://www.officialgazette.gov.ph/constitutions/1987-constitution/"
    ],
    "content": "PREAMBLE\nWe, the sovereign Filipino people, imploring the aid of Almighty God, in order to build a just and humane society... do ordain and promulgate this Constitution.\n\nARTICLE I: NATIONAL TERRITORY\nThe national territory comprises the Philippine archipelago, with all the islands and waters embraced therein, and all other territories over which the Philippines has sovereignty or jurisdiction.\n\nARTICLE II: DECLARATION OF PRINCIPLES AND STATE POLICIES\nSection 1. The Philippines is a democratic and republican State. Sovereignty resides in the people and all government authority emanates from them.\n..."
  },
  {
    "id": "const_02",
    "title": "1987 Constitution: Bill of Rights (Art. III)",
    "excerpt": "The fundamental rights and privileges of every Filipino.",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Preamble_of_the_1987_Constitution_of_the_Philippines.jpg/640px-Preamble_of_the_1987_Constitution_of_the_Philippines.jpg"
    ],
    "sources": [
      "https://www.officialgazette.gov.ph/constitutions/1987-constitution/"
    ],
    "content": "ARTICLE III: BILL OF RIGHTS\n\nSection 1. No person shall be deprived of life, liberty, or property without due process of law, nor shall any person be denied the equal protection of the laws.\n\nSection 2. The right of the people to be secure in their persons, houses, papers, and effects against unreasonable searches and seizures...\n\nSection 4. No law shall be passed abridging the freedom of speech, of expression, or of the press...\n\nSection 12. (1) Any person under investigation for the commission of an offense shall have the right to be informed of his right to remain silent and to have competent and independent counsel..."
  },
  {
    "id": "const_03",
    "title": "1987 Constitution: Government Structure",
    "excerpt": "The Legislative, Executive, and Judicial Departments (Arts. VI-VIII).",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/e/ec/Malaca%C3%B1an_Palace_%28cropped%29.jpg"
    ],
    "sources": [
      "https://www.officialgazette.gov.ph/constitutions/1987-constitution/"
    ],
    "content": "ARTICLE VI: THE LEGISLATIVE DEPARTMENT\nThe legislative power shall be vested in the Congress of the Philippines, which shall consist of a Senate and a House of Representatives.\n\nARTICLE VII: THE EXECUTIVE DEPARTMENT\nThe executive power shall be vested in the President of the Philippines. The President and the Vice-President shall be elected by direct vote of the people for a term of six years.\n\nARTICLE VIII: JUDICIAL DEPARTMENT\nThe judicial power shall be vested in one Supreme Court and in such lower courts as may be established by law."
  }
]